Connected to Python 3.13.2

In [ ]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import statsmodels.api as sm
from scipy import stats

In [ ]:
# data
df = pd.read_csv("input/titanic.csv")

In [ ]:
# vertical 1 obs view
print(f"{df.shape}")
print(df.iloc[0, :].to_string())

(891, 15)
survived                 0
pclass                   3
sex                   male
age                   22.0
sibsp                    1
parch                    0
fare                  7.25
embarked                 S
class                Third
who                    man
adult_male            True
deck                   NaN
embark_town    Southampton
alive                   no
alone                False

In [ ]:
# vertical info view
_ = pd.concat([df.head(1).T, df.dtypes, df.isna().sum()], axis=1)
_.columns = ["example_value", "dtypes", "n_null"]
_

            example_value   dtypes  n_null
survived                0    int64       0
pclass                  3    int64       0
sex                  male   object       0
age                  22.0  float64     177
sibsp                   1    int64       0
parch                   0    int64       0
fare                 7.25  float64       0
embarked                S   object       2
class               Third   object       0
who                   man   object       0
adult_male           True     bool       0
deck                  NaN   object     688
embark_town   Southampton   object       2
alive                  no   object       0
alone               False     bool       0

In [ ]:
df2 = df.select_dtypes(include=["number"])
if df2.empty:
    print("No numeric columns to describe.")
else:
    df2_res = df2.describe(
        percentiles=[
            0.01,
            0.05,
            0.25,
            0.5,
            0.75,
            0.95,
            0.99,
        ]
    ).T
    print(df2_res.to_string())

          count       mean        std   min   1%     5%      25%      50%   75%        95%        99%       max
survived  891.0   0.383838   0.486592  0.00  0.0  0.000   0.0000   0.0000   1.0    1.00000    1.00000    1.0000
pclass    891.0   2.308642   0.836071  1.00  1.0  1.000   2.0000   3.0000   3.0    3.00000    3.00000    3.0000
age       714.0  29.699118  14.526497  0.42  1.0  4.000  20.1250  28.0000  38.0   56.00000   65.87000   80.0000
sibsp     891.0   0.523008   1.102743  0.00  0.0  0.000   0.0000   0.0000   1.0    3.00000    5.00000    8.0000
parch     891.0   0.381594   0.806057  0.00  0.0  0.000   0.0000   0.0000   0.0    2.00000    4.00000    6.0000
fare      891.0  32.204208  49.693429  0.00  0.0  7.225   7.9104  14.4542  31.0  112.07915  249.00622  512.3292

In [ ]:
df_obj = df.select_dtypes(include=["object"])
if df_obj.empty:
    print("No object columns to describe.")
else:
    print(df_obj.describe().T.to_string())

            count unique          top freq
sex           891      2         male  577
embarked      889      3            S  644
class         891      3        Third  491
who           891      3          man  537
deck          203      7            C   59
embark_town   889      3  Southampton  644
alive         891      2           no  549

In [ ]:
df_cat = df.select_dtypes(include=["category"])
if df_cat.empty:
    print("No category columns to describe.")
else:
    print(df_cat.describe().T.to_string())

No category columns to describe.